{
  "01/01/2016": "Today is the first day of 2016! I stayed up till 7 AM last night chatting with my family and cousin. I'm ready for the year.",

  "01/02/2016": "I went to DC today to go Ice Skating with Ally! Then we went to the natural history museum to look at the gems :) The exhibit looks so much different now -- they really added to it.",

  "01/03/2016": "I flew home from Baltimore to Austin today. Immediately when I got out of the airport I smiled. It's so nice to come home to Austin!",

  "01/04/2016": "First day back at work was super productive today! I Finished a presentation and reviewed a workshop.",

  "01/05/2016": "In the studio today, I found the December Net Magazine in which my Gallery article is published :) It was pretty cool.",

  "01/06/2016": "Today I tried the cinnamon roll flavored Quest bar. I picked out a really soft one and ate it at a coffee shop with an almond milk latte. It. was. amazing.",

  "01/07/2016": "Today was busy, busy. But I finally figured out our icon system after a ton of researching the options. I presented it today and everyone seemed pretty happy about the solution. Yay for wins!",

  "01/08/2016": "A group of friends and I played Rock Band today after work. I'm the drummer in our group and I tried out hard mode this time (definitely failed a bit at it) but it was SO MUCH FUN.",

  "01/09/2016": "Today I went on a first date that I actually really enjoyed (this never happens!). We went on a long walk around Town Lake and I even fixed my bike lock issue! It was both productive and really nice.",

  "01/10/2016": "Back in the coffee shop grind. I spent the evening at Bennu, one of my favorites, listening to good music (Spotify Discover is on pointe) and drinking almond milk lattes (my go-to beverage).",

  "01/11/2016": "Today was a sick day but at least I got to sleep in! And my presentation portion for G&TT got some positive feedback this round, which is exciting.",

  "01/12/2016": "Posted a rant post today about respecting OSS developers. It's getting a lot of shares and I'm glad people are reading and internalizing it.",

  "01/13/2016": "My speech script for G&TT got approved with good feedback today -- so that's a relief :) finally hearing some good things about it.",

  "01/14/2016": "I saw Alex (P) again today! We went to an arcade called Pinballz and played DDR and it was *so* awesomely nostalgic. Ahh I had so much fun! And even embarrassingly somehow remembered a few of the moves to one of the songs (Captain Jack).",

  "01/15/2016": "I just hung out by myself this Friday and it felt really good to hang out at Bennu coffee and finish up an article that I was having a little trouble with. Just sat down, focused, and whipped it up.",

  "01/16/2016": "Tonight, an actor friend of mine and his friends put on a play reading/release party for their new art zine. They did a play about workers in a movie theatre for about 25 people and it was *awesome*.",

  "01/17/2016": "I went mini golfing with Alex (P) today at Peter Pan. It was really cute and then we got some Tex-Mex and hung out on my porch/at my place for the evening. The sun set was pretty awesome today too.",

  "01/18/2016": "Today I felt super productive. I made a list of 16 things (8 at work, 8 for after) and I just buckled down to get through it and put in great PRs in the process.",

  "01/19/2016": "I started listening to the First Fifteen Lives of Harry August at the gym today and it is *so* good I didn't want to turn it off.",

  "01/20/2016": "I recorded an interview with Jon Cutrell of Developer Tea today and it turned into a really good conversation that got kind of deep into the theoretical future of tech which was awesome and different than the norm.",

  "01/21/2016": "I'm hanging out with the Brooklyn JS crew today at Boroughgramming. What an awesome group of people! It's such a family here. Room is super tight at the meetup, but the vibe is so warm and welcoming.",

  "01/22/2016": "I met Leah's roommate today and we went out around her neighborhood on the Lower East Side. It was a lot of fun drunkenly frolicking in the snow on the way home and dancing.",

  "01/23/2016": "OH MY GOSH IT SNOWED SO MUCH. My flight is already canceled for tomorrow. So I stayed in with Leah and we watched movies (a really good one called The Road Within) and then drank wine while watching terrible TV (Married at First Site).",

  "01/24/2016": "Today I went out with Leah to a little restaurant called Poko. I didn't intend to drink but they had beet cocktails and the bartender/owner made us amazing Tiramisu dessert cocktails. He also made me grilled octopus salad and her incredible lamb chops! SO Good.",

  "01/25/2016": "Today I was upgraded to first class (for the first time in my life) on my flight to Austin from JFK! It's so nice! They give you warm towels, snacks, and a warm meal with gelato served on a \"table cloth\". And real glass for drinks!",

  "01/26/2016": "My first day back was crazy! I woke up to Smashing Magazine having shared one of my blogs before I finished it (recorded audio) so I did that really quickly, then got emails back from publishers and jobs so ahh. So much happened.",

  "01/27/2016": "Alex (P) randomly messaged me about this showing for Kasita -- a new living concept in Austin. It was cool to see and we walked for a while / hung out for a bit after.",

  "01/28/2016": "One of my coworkers made me a name tag today with a rainbow unicorn on it and hung it above my desk :D",

  "01/29/2016": "Today one of my coworkers brought his adorable 4-year old son in for part of the day. He built me a tower to put my drink on top of :)",

  "01/30/2016": "Today was absolutely beautiful! I went to Hamilton Pool with friends and then we went to get lunch at the Oasis. It's 80 degrees in January. I love Austin.",

  "01/31/2016": "Continuing with the streak of beautiful weather, I went kayaking with a few friends then to a friend's dinner party where he made us Korean barbecue.",

  "02/01/2016": "I've been working on a technical exercise building out a sock-themed search and it's been really fun! I hope they enjoy reviewing it at much as I've enjoyed building it.",

  "02/02/2016": "I made Valentines Day cards today to prep them for sending out to people :) It was really relaxing and fun.",

  "02/03/2016": "Net Magazine came in the mail today (the one with my CSSgram feature) and that was pretty awesome to see! :D",

  "02/04/2016": "Played Rock Band today at Chris' place. Ahh it was so much fun. A much bigger crowd than usual, but it was great and we were all belting the songs out in unison.",

  "02/05/2016": "Went out tonight for Troys birthday. It was so much fun. I basically just got really drunk with a lot of my friends around east side.",

  "02/06/2016": "I went out dancing (like, social dancing) tonight for the first time with Lizzy and her friend Kevin! It was actually a ton of fun :) I'd probably go again, and maybe try to learn and get better for next time.",

  "02/07/2016": "This morning I did brunch at Bangers with a few people. Mae brought her dog and there were so many cute puppers around! That plus an awesome live band and a beautiful day made for a wonderful morning meal.",

  "02/08/2016": "I did lunch with Lauren today at Whole Foods. We walked over from work. It was a nice walk and we got to catch up. I love the halibut they've been having at Whole Foods lately, too.",

  "02/09/2016": "We recorded Toolsday today and it turned out to be a really fun episode about static site generators. It's awesome to get to host a podcast at work and a lot of fun :)",

  "02/10/2016": "Went to Lucky Robot on South Lamar for sushi with Alex (P) today. It was really good :) We went to Half Step afterward.",

  "02/11/2016": "Went back to the gym today! And kicked ass at kettle bells! And it felt SO good!",

  "02/12/2016": "I had a photoshoot with Lauren today. It was so much fun! And we got some really great shots.",

  "02/13/2016": "I spent the day being really productive, fixing bugs, doing laundry, and writing half a blog post. I then rallied after midnight to go out on 6th.",

  "02/14/2016": "Today was really great! I began to code up a UI for a SXSW event at Bennu with a coworker, then we got dinner and ended up going to listen to a jazz drummer at the elephant room, then to Peche for absinthe cocktails.",

  "02/15/2016": "I saw the movie Deadpool with Mae today at the Alamo Drafthouse. It was *such* a good movie! Super funny and entertaining.",

  "02/16/2016": "Hung out in Brew and Brew today until late to work on the SXSW app. I ran into someone from town and we got to chatting/catching up which was super nice.",

  "02/17/2016": "Stayed after work with Alex (H) today to work on the SXSW jukebox app. We finally pulled some of the back and front end together which is always an exciting moment :)",

  "02/18/2016": "We streamed the TED 2016 conference in the kitchen of the studio today. I ended up watching a few talks over lunch (and they were *really* good!)",

  "02/19/2016": "I went to lunch at a new place (for me) called Twisted Root with a bunch of coworkers. It was awesome! And I got a delicious salad with a turkey patty and fried egg and pickled onions. Yummmm.",

  "02/20/2016": "After lunch and coffee shop hangs with some friends, I biked over to the dog park in Zilker and watched the pups :) It was a great day.",

  "02/21/2016": "I arrived and went shopping in NYC today! It was fantastic. I bought 3 new crop tops, 4 new rings, a vest, and a really cute pair of black leather booties from Kenneth Cole!",

  "02/22/2016": "Started the morning with breakfast at my favorite TriBeCa coffee shop -- Gotan :) It's always so good!",

  "02/23/2016": "I spent the night futzing around with water coloring some flowers, and they ended up actually looking pretty awesome! I love how they turned out and I added a quote on them in calligraphy.",

  "02/24/2016": "I feel so much better now that I've lost a bit of weight. Clothes fit me better and my new skinny jeans are big on me -- so I went shopping for some new(er) clothes.",

  "02/25/2016": "Today I went shopping (yes, again) :P for some coats for the upcoming ski trip I'm going on this weekend! I found a really awesome deal on a packable (aka super light) down coat so that was fun.",

  "02/26/2016": "The Internet was out at work today so I went to Cenote to work with Alex -- I had this *incredible* salmon salad with goat cheese and beets and omgggg it was so delicious and also beautiful out!",

  "02/27/2016": "Today we got to Colorado for the ski trip. The night was insanely clear and I ended up in the hot tub with Troy and Dan, having some really nice/deep conversation and looking up at the stars. You could see them *so* clearly it was insane.",

  "02/28/2016": "We went skiing at the Winter Park ski resort today. I got to the top of the mountain and went down by myself. It was really awesome and so, so, so beautiful up there. The view was incredible. You could see snow-capped mountains for miles.",

  "02/29/2016": "This morning we had to head back to fly out, and stopped by the Buff in Boulder for an incredible breakfast (we shared a fruit bowl carved out of cantaloupe and I got an omelet with salmon and goat cheese and capers in it). Then we went hiking for a short while at Chautauqua Park before heading to the Denver airport. It was *beautiful*.",

  "03/01/2016": "I came back to my desk today to a sticky note from Alex that said \"Welcome Back. Play a Game!\" and an arduino game he made me! It was seriously the most awesome morning surprise :) I can't get over how happy it made me.",

  "03/02/2016": "Dallas hosted a flower crown making party pre-renaissance faire at her place. We had wine and cheese and made flower crowns :) It was a lot of fun.",

  "03/03/2016": "We did an after-work happy hour at Dogwood today. It was so much fun :) A lot of people came out, and I got this really yummy drink called the Texas Mule which came with a little orchid on top in a mason jar.",

  "03/04/2016": "I went out dancing tonight with a bunch of friends at the Empire Control Room. It had been a while since I danced like that. Much needed!",

  "03/05/2016": "I went over to Alex's and we made dinner (salmon and brussels sprouts that turned out *amazing*) and then listened to records! It was such a nice evening. I can't even explain it.",

  "03/06/2016": "I went to the Zilker Kite Festival today with Alex. It was a great windy day for it and I remember seeing SO many adorable dogs and kites everywhere.",

  "03/07/2016": "I met up with THREE awesome ladies from #makeupconf today! I had lunch with Duretti and then got wine and cheese with Monica and Chelsea. We went to Mikkeller Bar in SF and it was fabulous. All of those women were so down to earth and so much fun.",

  "03/08/2016": "Today I flew out from San Francisco. I picked up Blue Bottle Coffee on the way to the airport (OMG SO GOOD) and had a really lovely ride out of the city.",

  "03/09/2016": "I got THREE letters in the mail today! I love letters. That was so rad to get three at once :)",

  "03/10/2016": "I went to lunch with a bunch of coworkers at the physical Chilantro location. It was so good! Like, SO good. I can't wait to go back for more.",

  "03/11/2016": "Today was the first day of SXSW and also the IBM Design Hive party. The jukebox is finished, Toolsday went well, and I got to interview Dan Cedarholm for IBM Asks.",

  "03/12/2016": "Today was *so* much fun! :) I love SXSW. I ended up going around to a bunch of places, ping ponging between groups. I hung out with Ian and saw RObert DeLong and snuck into a lounge for some ice cream. There was also this great Women in Austin Tech event on the 24th floor of a building. I ended the night with Alex and his sister as we were the dance party.",

  "03/13/2016": "Today was another day of SXSW -- I went to the Facebook/Instagram happy hour for a while and they had a lovely open bar as well as yummy finger foods. I hung out there for a *while* with a bunch of coworkers and we saw Santigold perform at the Container Bar next door.",

  "03/14/2016": "More SXSW fun :) I hung out with Alex for most of the day after WFH in the morning. We saw some of the things I had missed before and got brunch at Bangers for a SoFi event. The night ended with us going to one of Ryan Hamrick's lettering and Jameson events.",

  "03/15/2016": "I stopped by the Spotify House today for a little while to catch Jack Garret perform. It was a fun concert and I got a lot done in the morning while working from home as well.",

  "03/16/2016": "I got *two* awesome pieces of mail today for me into the IBM studio from people who sent me stickers! I love getting mail a lot.",

  "03/17/2016": "Today I bought the most adorable/perfect milk jars to put my homemade almond milk inside. I went shopping for sunglasses for this weekend and found them at Sur La Table, which I happened to drop into today.",

  "03/18/2016": "I went camping today for the first time in Palo Duro Canyon State Park. It was super fun to build a nest of blankets inside the tent to keep warm and problem solve to make things work.",

  "03/19/2016": "Today was absolutely beautiful! I woke up in the Palo Duro canyon and made eggs while leaning out of a tent and went hiking with Alex. Such a beautiful place! And morning! And day!",

  "03/20/2016": "Alex and I drove home from Palo Duro/Monahans Sandhills State Park today and the sky was super clear so I asked if we could stop. We ended up climbing onto the roof of his car for a while to stargaze.",

  "03/21/2016": "I did a bunch of research on this cool place called the Seashell house and submitted a PR proposal for a trip to the repo Alex made for us :) I hope we end up there. Planning trips makes me so happy.",

  "03/22/2016": "Today was a team lunch for birthdays. We basically took over this entire BBQ lunch spot. The food was good, but it was even funnier to see so many Bluemixers there.",

  "03/23/2016": "I got dinner with Rebecca today! (It's been so long!) And it was really great to catch up. Everything has been to crazy right now that it almost felt like a therapy session. We also went to Foreign & Domestic -- which has been on my to-do/bucket list. The scallops we had (yes, we ordered the same thing :P) were *AAMAAZEE*.",

  "03/24/2016": "I started listening to The Power of Habit today -- it's a really good audio book about psychology and I'm really into it.",

  "03/25/2016": "I decided to accept the offer from Digital Ocean today. Which basically makes my life a lot easier and pretty open :). I'm excited. I remember having a long conversation over Skype at Flightpath Coffee with my parents about it.",

  "03/26/2016": "I had a long walk by myself and made it to PaperSource at the end of it today. I love that store! And just taking long walks while listening to audio books.",

  "03/27/2016": "I got brunch with Allison House today :) It was really fun! I wish we hung out more in Austin because we really get along and the place was awesome too!",

  "03/28/2016": "Today I woke up to a map outside of my door with a volcanic rock on top of it from Alex. It was unbelievably adorable. He told me his story later about his Arizona trip when we hung out and used it as a basis.",

  "03/29/2016": "I had a really productive day. I got a few pull requests in to close various design system website issues. I've been getting a lot done at work this week.",

  "03/30/2016": "There was a happy hour for Matt's going away at Dogwood today. We ended up getting food next door at a Cajun place and then went to Alex's to chat and look at maps.",

  "03/31/2016": "Onboarding for Digital Ocean is adorable. The site has this awesome timeline of the company's history and puts your start date on it. They also make everything really nice and lucid.",

  "04/01/2016": "Today we had our team retrospective -- we've been super productive lately so it felt good to go over and see all the work we did summed up in two weeks.",

  "04/02/2016": "Today was great. I hung out with Alex all day, first at an 80's-themed pool party and then dinner at Laurens. The  -- sun set over her lake, bought chartreuse and made a blanket fort",

  "04/03/2016": "Today was the Zilker Garden Festival. Though I didn't buy any flowers, I biked there with Alex and we explored the Botanical Garden grounds. My favorite was the Japanese zen garden.",

  "04/04/2016": "after speaker dinner drinks at this really cool bar called the Monkey Bar as a nickname in SF with Jina, Vitaly, and Harry. Bought Pez",

  "04/05/2016": "The SmashingConf after party was at the aquarium! It was a lot of fun! The otters were out and super playful, we got to pet sting rays, and the jellyfish were pretty mesmerizing. Monica also came!",

  "04/15/2016": "Today was my last day at IBM. We went to a happy hour at Dogwood and Alex got me a little orchid which he left on my desk, for my new desk \"wherever that is.\"",

  "04/16/2016": "Pattern party! Today I prepped with Alex all day and set up the cheese board and decor and rum punch for my going away party. It was so much fun! And such a great day!",

  "04/17/2016": "I arrived in NYC for onboarding today. The Sheraton where I'm staying has this beautiful rooftop which you can access as an SPG club member. It's an awesome perk with anincredible view of the Empire State building and skyline.",

  "04/18/2016": "Ahh! It's my first day at Digital Ocean! It was a great day -- I was welcomed with so many tshirts (3 of them!), a kindle, slippers, and a lot of warmth from the team. :) This seems like such a rad place.",

  "04/19/2016": "Today I went to __ with my team for a welcome dinner. It was so good! I got trout and a few of the team freaked out that it still had the fish head but whatever :P It tasted great.",

  "04/20/2016": "I learned today that my coworker makes mini-mason-jar cheesecake and its *SO* good. I've been loving working at DO so far and learning about my cool new coworkers.",

  "04/21/2016": "Tonight was the speaker dinner for Generate. The restaurant, Buddakan was *fantastic* and it was such a nice reunion! Afterwards we got drinks at a great cocktail bar and stayed out late.",

  "04/22/2016": "Generate went really well and was so much fun! The speakers were great and my talk went well. After the conference we got dinner at this Korean BBQ place which was delicious and I was pretty drunk because Tim kept buying everyone rounds of drinks.",

  "04/23/2016": "I was home for Passover today! It was so nice to see my family but I also got to see Liza (and her engagement ring for the first time!). Catching up was *so* nice and necessary.",

  "04/24/2016": "This morning I went to Ross to go shopping with Liza for outfits for her engagement photo shoot. I also ended up buying some dresses before I headed back to Austin.",

  "04/25/2016": "Today I finished building Diffee (which I started yesterday) and published it. I'm really excited about this project -- simple and effective :) It made me really happy to ship it fast. Now I just want to do more!",

  "04/26/2016": "I worked remotely today, then went to see a documentary on Texas National Parks with Alex -- we saw Dan there too :) Afterwards, we biked to Cherrywood to do some work and eat some food. I got a lot done in terms of tasks I just needed to check off.",

  "04/27/2016": "I went to Uchi with a group of friends tonight. It was *so* good! And I'm so glad I finally got to check it off my Austin bucket list. Favorites included the brussels sprouts, crunchy rice, and the yucca chips with hamachi and almonds and other things. It was a really fun time, too.",

  "04/28/2016": "I went to the Sass meetup today. Seeing that it's still going on made me really happy. It was super nice to have it at the Iron Yard too.",

  "04/29/2016": "I went to Cheer Up Charlies today and there was this hilarious guy dancing on his own on tables and throwing around business cards. It was great. After that show I went over to Alex's and we made a cheese board and had wine and watched Somm.",

  "04/30/2016": "Today Alex and I started at a block party for a few shops on the east side. We then ended up hanging out all day and drinking all day bouncing around various happy hours until we ended up at the Townsend and stumbled upon a concert from Levitation fest getting canceled in a super intimate venue.",

  "05/01/2016": "I built a pretty rad blanket fort tonight with Alex. We also finished up some wine and cheese inside the tent while doing Sunday updates.",

  "05/02/2016": "I launched the initial signups for Web Love Weekly today. I got a great response already :) I'm excited to keep this newsletter going.",

  "05/03/2016": "I recorded Toolsday with Chris today! It was great to see him again because its been a little while. Also I think the episode was a pretty good one! I'm so happy to get it started up again.",

  "05/04/2016": "Sent out my first Web Love Weekly newsletter today! I'm pretty happy with how it turned out and happy that I'm doing this :)",

  "05/05/2016": "Cinco de mayo! I got lunch with Alison House today and we went to Frank and talked about all of the things and it was great :)",

  "05/06/2016": "I had a girls night with Lauren and Jo :) We went to this restaurant called True Food Kitchen and then visited another friend at the restaurant where he worked for some dessert.",

  "05/07/2016": "Today was beautiful! I went on a run and ended up at the Pecan Street Festival. After that, I went to this maker faire nighttime event put on by Argo design and watched a band play static electricity to make music.",

  "05/08/2016": "I did some serious shopping with Jo today (much needed). Bought some sandals, shorts, dresses, and a few other goodies :) We ended up shopping for 5. hours.",

  "05/09/2016": "I went to Bangers for this pugs in togas event put on by the Austin Pug Rescue. I ended up winning a $25 gift card to Bangers and got to catch up with some friends, too.",

  "05/10/2016": "Today on a whim I started playing around with getUserMedia to update CSSgram with camera functionality. So now you can take a photo and have it get filterized!",

  "05/11/2016": "I packed for the long drive thats coming up soon today. Alex got me flowers and they're in my room and they make me smile every time I look at them.",

  "05/12/2016": "Alex and I drove to New Orleans today! We checked into our AirBnb and headed right to Frenchman street (3 blocks from the AirBnb). There was so much Jazz outside on the street and we went to this amazing bar called Cane & Table as per a friend's suggestion.",

  "05/13/2016": "I spent today in New Orleans with Alex! It was really awesome to walk around the French Quarter (which is so beautiful!) and we had an amazing dinner a few street car stops away. The best meal of the day, however, was the wine and cheese/charcuterie plate at Bachannal.",

  "05/14/2016": "Alex and I stopped in Chatanooga, TN for dinner during the drive. We ended up at a surprisingly good restaurant called the Flying Squirrel. There was an open canoe shell lighting fixture on the ceiling and the food was pretty great. It was a solid stopover.",

  "05/15/2016": "I finally got to my home with Alex today. We played with the AirBnb's dogs in the morning (there were 2 adorable big dogs and a cat) and then made the final stretch of drive, going along the Blue Ridge Parkway to get there. Needless to say, it was  extremely beautiful.",

  "05/16/2016": "I went to the creamery with Alex today (the only attraction my hometown has). While I didn't see anybody I knew, it was really nice getting ice cream together (for the first time!).",

  "05/17/2016": "I played with Legos in my home today with Alex :) It was so much fun to try to make space ships out of our extra parts and finding items from old Lego sets like my Harry Potter set.",

  "05/18/2016": "I had dinner at Liza and Matt's place today. She asked me to be her maid of honor via a wine bottle that had a poem on it :) I can't wait to plan with her and be there for her!",

  "05/19/2016": "I visited DC with Alex to meet my college roommates (Ally and Vicki) and hang out there for the night. We went to Momofuku and then the Columbia room -- which was an *amazing* bar experience. It was seriously amazing drinks that were paired with little snacks and the last one was a zen garden you would rake yourself.",

  "05/20/2016": "I went with Alex to the Renwick gallery today in DC. It's such a cool gallery full of rad installations. My favorite was stalagmites made out of notecards.",

  "05/21/2016": "Today I flew into Punta Cana! The resort is super pretty! Seriously looks like a palace -- and there is so much fresh fish here. I'm excited for the week.",

  "05/22/2016": "Today is day two in the Dominican Republic with my family. The weather has been *so* nice here :) I played bocchee and did surprisingly well - and also drank rum-infused iced cappuccinos in the pool bar.",

  "05/23/2016": "Today I discovered this drink here where they take a cappuccino, blend it with ice, and I also had them add white rum. It was soooo good! Like an alcoholic frapuccino.",

  "05/24/2016": "My tan is starting to come in nicely! I'm pretty proud of the fact that I haven't gotten a sunburn yet despite it being so sunny here.",

  "05/25/2016": "Okay so keeping with the positive theme, I probably lost about 6 lbs today because I've been sick and unable to eat or drink. So while I spent the day in bed with a stomach bug, I probably didn't need another full day of day drinking.",

  "05/26/2016": "I was well enough to make it to the beach today! #littlewins. I just lay in the shade and watched 3 more videos from Google I/O that I had saved earlier for offline.",

  "05/27/2016": "I still felt kind of sick today, and I got a massage to help with some aching from laying in bed all day. By night, I felt well enough to finally go out and dance, though!",

  "05/28/2015": "It's my last day in the Dominican Republic. I'm still feeling a little sick but the weather is so nice and I'm going to miss the little hummingbird that has a nest (with TWO eggs now!) near our beach spot.",

  "05/29/2016": "I finally came back home to Austin today. The flights were rough, as I realized I'd left my wallet, keys, and ID in the Punta Cana Airport, but Alex got me flowers and got me a spare key and made my bed for when I got back. It was super super nice of him!",

  "05/30/2016": "Alex hosted a Memorial day pool party at our apartment and had a big cook out. He made this absolutely *incredible* short rib (seriously, it was the best I've ever had, and I watched how it took him literally all day to make). We also made caramel creme-brule cheesecake strawberries together :)",

  "05/31/2016": "I worked at Cenote today, and learned that there's a discount for paying in cash instead of card. No tax!",

  "06/01/2016": "Went on an impromptu date today with Alex. We went to Isla and OMG the chef's seasonal ceviche is amazing. Amazing. I love their ceviche and their cocktails and I want to eat ceviche forever.",

  "06/02/2016": "I got a lot of work done today. It was just a production day, but I made a lot of progress on my talk and I almost finished it!",

  "06/03/2016": "Because it's so nice out, but also I have to finish this talk, I went to Mozarts with Alex after work. We then got dinner at Hula Hut when it started POURING this ridiculous torrential downpour. But we got home and instead of going out, stayed in to catch up on Game of Thrones :)",

  "06/04/2016": "Hack for Change was today! It's been a lot of fun and I'm trying to only do JavaScript/ avoid UI engineering to try something new. I've been successful so far.",

  "06/05/2016": "At the hackathon, Alex and I made a friend David who was on our team, who invited us to come with him to go floating down the San Marcos river. The weather was perfect! Insanely perfect!",

  "06/06/2016": "Today I ate way too much. I got Korean hot pot with a bunch of friends, some of whom I hadn't seen in much too long, and then we all went to Mooji for ice cream sandwiches. The seats were swings!",

  "06/07/2016": "I worked pretty late today with Alex for company. It was nice to be able to build and have someone just sit next to me in the meantime. I started building an app using getUserMedia and blend modes.",

  "06/08/2016": "Today was so, so productive at work, and I finally saw some real metrics behind what I've been doing to improve performance and accessibility. It was pretty rad.",

  "06/09/2016": "Alex and I made dinner today (avocado pesto zucchini pasta with shrimp). We used the basil plants we've been growing for the pesto :)",

  "06/10/2016": "I did a little bit of hand lettering today (which I hadn't done in a WHILE). That was super nice, especially taking a moment to sit down and actually paint again.",

  "06/11/2016": "I got brunch with a bunch of my friends today at East Side Cafe. I had never been there before but *loved* it (and the blue plate special was eggs Benedict on a lox+shrimp cake!). It was so good to see everyone before heading off to Amsterdam.",

  "06/12/2016": "I woke up early today, went to the gym, then hung around West Austin for a bit. I ended up in Paper Source admiring all of the cards and cute trinkets/gifts/papers for way too long.",

  "06/13/2016": "On the way to get mail, I ran into Alex in the elevator and he went with me. Turns out our cotton bureau shirts came in -- the ones with party parrot on them. We put them on when we got to my place and imitated the parrot. It's all captures on video. A beautiful video.",

  "06/14/2016": "I'm headed to Amsterdam today with Alex! I worked throughout the day and on the airplane for all of the domestic legs of the flight. Felt pretty productive and like I was contributing a lot throughout the day.",

  "06/15/2016": "Today Alex and I arrived in Amsterdam and it was also the day of the speaker dinner. Dinner was at this Belgian place that provided wine pairings with the tapas-style food. SO MUCH WINE was drank. They served 7 glasses with the meal, plus we got Belgian beer beforehand.",

  "06/16/2016": "Today was the first day of the CSS Day conference!",

  "06/17/2016": "After the conference (I did my Practical Blend Modes talk today for the first time), I went to a really rad speakeasy called Door 74 with Alex and 2 other people we met at the conference. It was *such* a great bar in Amsterdam, and the drinks were super unique and came in these beautiful containers (tiki glasses with red currant, skulls, one drink was out of a horn). We also went to a pretty nice bar after that one called Tales & Spirits across town.",

  "06/18/2016": "Alex and I went to the flower market today (our last day in Amsterdam). We woke up way too late (oops) and ended up having a lunch that consisted of free cheese samples from all of the cheese stores :P I'm amazed at the variety of flowers here!",

  "06/19/2016": "Today is Open House Porto -- an event where you can walk through private (non touristy) buildings with their architects and learn about their histories. I did this event and even met a friend with Alex. We did a ton of walking and ended our night with dinner at a piadina restaurant that had an olive tree table!",

  "06/20/2016": "I had my first pastel de Nata today at the Café Magestic! Then, Alex and I went to the top of the Clergios tower/explored the church. Afterward, we went to an awesome park in front of it where we sat on the grass and drank 'shaken' coffee out of champagne flutes.",

  "06/21/2016": "I went to the beach today with Alex in Matoshinos. It was super nice to relax there for a bit, even though the water was freeeezing. Later in the night, we made dinner and stayed in drinking green wine from the market downstairs and watching Silicon Valley.",

  "06/22/2016": "Today Alex and I sort of stumbled upon Sé Porto (Cathedral) and ended up on the top of the Luis bridge. The views were honestly breathtaking (and so was climbing all of those stairs :P) Worth it!",

  "06/23/2016": "Today was Sao João! It's an insane holiday and definitely my new favorite. Alex and I got little plastic hammers to bang on everyone's heads and ate grilled sardines and watched really exceptional fireworks. The atmosphere was electric, and I even helped a group of people launch a lantern! We then danced outside at various dance parties and drank until 5:30 AM. Seriously. It was amazing.",

  "06/24/2016": "Tonight, Alex and I stumbled upon an *amazing* dining spot called Reitoria near the Galeria de Paris. We split a bottle of wine and had the most beautiful meat and cheese plate I've ever seen.",

  "06/25/2016": "I went to Aveiro today with Alex! It's such a cute little town. They call it the Venice of Portugal because of the canals, but it's much much smaller. We toured around in one of the gondola-like boats and then watched most of a soccer game in an outdoor viewing area with a bunch of other people while eating Port-flavored ice cream (with Port jam on top!),",

  "06/26/2016": "Alex and I rode a train into the Douro Valley region today to get to the vineyard we were staying at. WOW. It is BEAUTIFUL here. Honestly, I'm so so so stunned by the landscape, and the vineyard (Quinta De La Rosa), which had a pool and a few trails to walk, was perfect.",

  "06/27/2016": "Tonight Alex and I finally got into the restaurant called Puro (apparently its new in Porto and also weirdly hard to get into). Anyway -- it was *AMAZE*. The best meal I've had here, and I've had a lot of great meals. We had wild boar for two for dinner and I still don't understand how it was so tender and crunchy at the same time. The potatoes on the side were super homey and great, too :)",

  "06/28/2016": "There's a little tea shop on Rua das Flores, right by where we're staying in Porto, and we keep trying to go but never find it open. Today, it was finally open, and it was *so* yummy! There was an upstairs part which used to be a jewelry store, so Alex and I explored a bit up there and found an old sketchbook full of jewelry sketches.",

  "06/29/2016": "Today Alex and I woke up early(er than usual) to rent bike and bike to the beach. We ended up biking 1.5 hours away to this chapel on the beach. I collected stones, Alex took some stabilized videos, and we both got incredibly sunburnt.",

  "06/30/2016": "We walked over to the Cristal Palace today and hung out in the gardens for a while watching two Mama peacocks and about 9 baby chicklet peacocks. Afterward we went to the Bolhao market and got some souvenirs and fruit (I also got fuzzy almonds). It's a super cool place.",

  "07/01/2016": "It's our last day in Porto! Alex and I did a tour of the monestary up on the hill (amazing view!) and got sangria before going on a boat tour. It was a good last day before packing up for Lisbon in the morning.",

  "07/02/2016": "Lisbon! We had one day to basically see all of Lisbon and we did our best. Alex and I wandered around a lot, and climbed a lot of hills, and did a walking tour through one of the neighborhoods. Then, we got dinner at this really cute wine bar where the entire restaurant was singing along to one of the customers taking the mic.",

  "07/03/2016": "This morning we stopped by a pastry shop that was a 10-minute walk from our AirBnB. We got way too much food (we each got a toast and a pastry -- one cream, one chocolate). But no regrets, because we ate the pastries on the plane and finished off our chocolate with some Port wine we snuck onboard.",

  "07/04/2016": "Happy 4th of July! Early today Alex and I drove out to a house his friends rented out for the long weekend. I tried to slackline and we had a water balloon fight and hung out in the river and set off sparklers and fireworks. It was perfect.",

  "07/05/2016": "Ahh it feels like I'm finally back to reality (although the past 3 weeks have been reality too, it's just a different feeling). I'm Back to working and it feels good to be productive. I also found a funny note from Alex while I was unpacking -- 'Your cheese credentials'. Nobody else reading this will understand that but I will :P",

  "07/06/2016": "I worked in a Starbucks today and did some grocery shopping at Whole Foods. Seems like a pretty normal day -- it was, but it was really enjoyable. I got a bunch of fresh food and meats and vegetables to cook this week. I'm happy to be cooking again in my kitchen after several weeks of mostly eating out.",

  "07/07/2016": "I went grocery shopping today (finally!). It was way more fun than it should have been because I hadn't gone in so long. I even picked up my favorite rice-free sushi from Whole Foods, and cant wait to cook!",

  "07/08/2016": "I stayed in tonight (woo! Friday!) but got some work done instead (specifically, going through that ES6 crash-course/refresher and building a Reveal Caniuse extension-type-thing). I also bought and filled out a 2016-17 planner with some flight infos!",

  "07/09/2016": "Tonight I saw a Master Pancake version of Raiders of the Lost Arc with a few friends at the Alamo Drafthouse (this is a comedy group that uses a movie as its basis). It was really funny and I got a tequila-infused chocolate milkshake (it was great, I swear), and then we went out dancing on 6th street.",

  "07/10/2016": "Today I got brunch at Geraldine's with Alex and afterward went down the street to Bar 96 to watch the Euro cup final (Portugal v. France). Portugal won! Yay! I was rooting for them since we were just in Portugal and missing it a ton already.",

  "07/11/2016": "I planned to do a little Pokewalk outside of downtown to get some pokemon today. Alex ended up picking me up and we both went to Mueller park where we hung out for 2 hours to catch some, and I reached level 5! It was so nice of him to hang out with me that long while I played despite him having 0 interest in Pokemon.",

  "07/12/2016": "PokemonGO stops opened in Austin! Today was such a fun day! I ended up walking all the way home through north Austin, the University of Texas, Burnet Road, and ended up at the Capitol, playing Pokemon with a bunch of players (and my friend who came to meet me) where lures were set up all night!",

  "07/13/2016": "So now that there are Pokemon stops in downtown, its been super easy to power up! I took a walk during lunch to collect Pokemon. It felt great :)",

  "07/14/2016": "Tonight I went to Blues on the Green (finally!) with Alex and some of his friends. This event is HUGE -- its crazy how many people attend. We got gyros and listened to music and hung out in Zilker park.",

  "07/15/2016": "Today I took the train up to the Domain to hang out for Jefferson's going away happy hour at Dogwood. We got drinks, then had dinner at Gloria's, and another group went to go see the movie Finding Dory. It was a fun Friday.",

  "07/16/2016": "I went on an extended Pokemon hunt today with Troy! I walked to Auditorium Shores and we hung out there for a while before moving on. It was so hot I jumped in the fountain (yes, an outdoor fountain full of children), and regret nothing.",

  "07/17/2016": "I went on another winery tour today for my birthday with a group of friends! We did brunch first and then visited 3 wineries. One of the wineries had peach and also jalepeño wine. It was really.. interesting. And they had the people celebrating birthdays take a shot of all of the (6) wines we tasted there (which was surprisingly good).",

  "07/18/2016": "Today a bunch of us got together for Lauren's house closing happy-hour-type-thing. Afterward I got gellato with Brian and Troy and we went down to auditorium shores to hunt for some charmanders.",

  "07/19/2016": "What a glorious day! I found my keys! They are not lost! And I ate or Koriente for the first time. It's really yummy :) I got a meal there which I took to the Capital to "Poke Picnic" at.",

  "07/20/2016": "Since I'm flying out tomorrow to head to Baltimore, I celebrated my birthday today with Alex. He made me a really fantastic dinner -- scallop salad and veal with brussels sprouts. AND he made me a chocolate-espresso cheesecake as my bday cake. AND he sponsored an emoji on my behalf AND we went to this rad new speakeasy called the Floppy Disc Repair Company.",

  "07/21/2016": "I flew to Baltimore today and got to see my family and my pupper Lucy again. Shes always so excited when she sees me it makes me really happy.",

  "07/22/2016": "I'm 24 today! Ahh crazy. I got a lot of love from friends both in person and online. That meant a lot to me :)",

  "07/23/2016": "Today was full of so much love! The day started with my DC friends driving up to get brunch with me and my high school friends. Then, my family came over for a birthday dinner and afterward I went out with my Russian group of friends in Baltimore city. It was a lot of drinking and a lot of love. All in all, great birthday.",

  "07/24/2016": "I went wedding dress shopping with my best friend Liza today! It's so crazy that she will be a married lady soon and I'm going to be her maid of honor at her wedding. She looked really amazing in a few of the dresses and I really think she has already found a great one.",

  "07/25/2016": "I worked from home next to my pup Lucy today. If you sit in the right place, she will come snuggle next to you and pass out and snore just a tiny bit. It's so cute.",

  "07/26/2016": "It has been so long since I had good sushi, so my Mom and I got some sushi at a local place where the waiters literally know my family. It was yummy and made me super happy :)",

  "07/27/2016": "My Mom had a buy one/ get one free entree at Bonefish grill so we decided to go together. I love love love fish and they do some pretty great grilled fish dishes. I got salmon and blackberry sangria.",

  "07/28/2016": "I got crabs today with my Mom at an adorable crab shack in my hometown. The cream of crab soup had chunks of crab meat in it and was SO GOOD. And the crabs were great too :) I love Baltimore during crab season.",

  "07/29/2016": "Liza had people over for a dinner party tonight. I made brussels sprouts with melted Parmesan cheese, which went over very well :) It was also just a great time with a great crew. Perfect end of my Baltimore trip.",

  "07/30/2016": "Today I began my journey to Argentina! And I got upgrades on both of my flights today :) Even though they were both delayed, sitting in first class with unlimited wine is the best way to sit on a delayed plane.",

  "07/31/2016": "I finally arrived in Buenos Aires today! And my luggage arrived to :) Tonight I ended up meeting up with a friend of a friend at this big college party the Hillel at the University of Buenos Aires threw, with a ton of student art, poetry, a live band, and live mural painting. I had a lot of Fernet and talked to a bunch of people.",

  "08/01/2016": "Today a few of the speakers who are local and organizers got together for dinner. OH my gosh. We went to a place with large plates intended for sharing and sure got a filling serving. So much meat. It was *so* good too. We stayed till midnight chatting and a few of them walked me home.",

  "08/02/2016": "I co-worked from this really cool agency called Aerolab today. They had great wifi, a cute space, and everyone was *so* nice! I got a tortilla for lunch and played ping pong with a few of the people here :) We got a lot of progress done on the website rebuild as well.",

  "08/03/2016": "I got to the speaker hotel today (called ILUM Hotel) and OMG is it beautiful. There's a water feature and good breakfast and floor-to-ceiling windows and they changed the bed out twice (one for the morning look and one for the evening!). I even took a bath today with jets!",

  "08/04/2016": "Today I had dinner by myself in Palermo, but it was *so* nice. I tried to order a salad to be healthy and got a heaping plate of chicken and dressing. It's fine, it was amazing. I also got the kumquat cocktail they had on special (I don't think I've ever had kumquats before to be honest). As soon as dinner came, someone set up two PokemonGO lures I was sitting in between. It was magical.",

  "08/05/2016": "I took a day off and went on a day trip to Uruguay (to a little town called Colonia) today. It was so nice! And I met a really rad woman on my tour who was headed to the Rio Olympics afterward. We had a lunch of local cheese and wine in this little cellar restaurant (we had a little too much Malbec for sure).",

  "08/06/2016": "Today Harry and I walked around all over the Recoleta area. We went to this really good lunch place, then a famous, and beautiful cemetary, then saw this metal flower statue. Speaker dinner for CSS Conf AR was also tonight and it was at this asado place -- which meant meat, meat, and more meat. OMG it was so good! And there was this pumpkin stuff too that was on pointe!",

  "08/07/2016": "I gave the first talk at the very first CSS Conf in South America today! The conference was great and the talk went really well and I'm so happy they're building up the community down there. The organizers are amazing. Its been a great day!",

  "08/08/2016": "Today I arrived in NYC for the kickoff of Shark Week! I wasn't as tired as I thought I would be and it was super cool to see everyone again!",

  "08/09/2016": "After work today was the DigitalOcean Women in Tech drinks. It was a nice event and we had an outdoor area in this speakeasy (yeah, I know that sounds strange). After, I got back to the office and proceeded to watch the Olympics there with one of my coworkers in our CEOs office bc there is a nice couch in there and its a nice open space.",

  "08/10/2016": "Today we did a Pokemon walk as a DO activity, and afterward celebrated the website launch with a team dinner at this Japanese restaurant called 6 Bond Street. Oh my god, we ordered *SO* much sushi they brought out this giant table-sized cylindrical bowl, and it was *SO* good. We also had a bit of sake.",

  "08/11/2016": "We had a game night at DO as a closing party for Shark Week since some people were not attending the weekend. I played werewolf for the first time and Connect Four with Joel and danced a little too. We ended up playing a massive game of flip cup, and since I don't drink beer, convinced the bartender to just let me take 2 bottles of champagne to the table, and played with that instead.",

  "08/12/2016": "Today was the first day of Shark Weekend! We drove down and played werewolf on the bus (some *really* good rounds of it). The hotel is super super nice, with very comfortable beds. We also had a few cabanas reserved for us, so the drinking began as soon as we arrived to the hotel. Drinking, swimming, and eventually dancing after dinner by the hotel bar. It was a fun night.",

  "08/13/2016": "I tried surfing for the first time today. I also learned I suck at surfing today. I did manage to catch four waves with the help of an instructor, and got up on my knees on two of them, however! So I was proud of myself for the day.",

  "08/14/2016": "We got back from Shark Weekend today. I had a good time chatting with everyone in the morning and going to brunch, but I was just so worn out from the week. I very happily spent the evening watching the Olympics and doing some ES6 tutorial watching by myself in my room. Gymnastics was on!",

  "08/15/2016": "Going back to Austin",
}
